tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "mongodb/brew"
tap "railwaycat/emacsmacport"
tap "hashicorp/tap"

# terminal
brew "bash"
brew "bash-completion@2"
brew "coreutils"
brew "tmux"
brew "reattach-to-user-namespace"
brew "git"
brew "hub"
brew "bat"

# search
brew "ripgrep"
brew "the_silver_searcher"

# editor
brew "vim"
brew "neovim"
brew "ctags"
brew "cmake" # prereq for vterm
brew "libvterm" # prereq for vterm
brew "sqlite" # prereq for magit
brew "gnu-tar" # prereq for emacs
brew "emacs-mac", args: ["with-natural-title-bar", "with-spacemacs-icon"]
brew "yamllint"

# productivity
brew "mas"
brew "task"

# programming tools
brew "hashicorp/tap/terraform"
brew "tfenv"
brew "grep"
brew "mongodb/brew/mongodb-community"
brew "jq"
brew "groovy"
brew "go"
brew "k9s"
brew "kubernetes-cli"
brew "kubectx"

# desktop apps
#cask "1password"
cask "alfred"
cask "firefox"
cask "font-fira-code"
#cask "google-chrome"
cask "iterm2"
#cask "slack"

# mac app store apps
#mas "Xcode", id: 497799835
mas "Magnet", id: 441258766
